//Составить программу вывода любого числа любое заданное число раз
import java.util.Scanner;
public class L5_hw1 {


    public static void main(String[] args) {

        Scanner sc= new Scanner( System.in);
        int n;
        System.out.println( "Введите n - количество повторений числа");
        n = sc.nextInt();
        System.out.println( "Введите g - число ");
        int g;
        g = sc.nextInt();


for (int i=0; i<n; i++){

        System.out.print(g);
                           }
}
}

